[
    {
        "title": "IoT Health Monitoring System for Sports: Real-Time Heart Rate and Temperature Trackig",
        "year": "2024",
        "role": "Engineer",
        "description": "IoT-based system that accurately monitors an athlete's heart rate and body temperature in real time using sensors and an ESP32, with data sent wirelessly to a web server.",
        "image": "images/project1.png",
        "link": "https://belajarmikrokontroler2k23.blogspot.com/2024/06/iot-health-monitoring-system-for-sports.html?m=1"
    },
    {
        "title": "Line Follower Robot",
        "year": "2024",
        "role": "Engineer",
        "description": "This project involved designing and building an autonomous line follower robot capable of detecting and following a predefined path using infrared sensors. The robot was programmed with basic logic to differentiate between black and white surfaces, allowing it to make decisions at turns and intersections. The goal was to demonstrate fundamental robotics concepts, including sensor integration, motor control, and algorithmic path tracking",
        "image": "images/linefollower.jpg",
        "link": "https://belajarmikrokontroler2k23.blogspot.com/2024/06/iot-health-monitoring-system-for-sports.html?m=1"
    },
    {
        "title": "Face Recognition Door Lock",
        "year": "2025",
        "role": "Engineer",
        "description": "This project implemented a smart door lock system using Raspberry Pi and OpenCV for facial recognition. The system detects and authenticates a person's face in real time; if the face matches a registered user, the door unlocks. If no authorized face is detected, the door remains locked and an alert notification is automatically sent via Telegram. This project highlights practical applications of computer vision, IoT integration, and real-time security monitoring.",
        "image": "images/face1.jpg",
        "link": "https://belajarmikrokontroler2k23.blogspot.com/2024/06/iot-health-monitoring-system-for-sports.html?m=1"
    }
]
